nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxl255/common/pin_mux/cm0plus/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v17.0
processor: MCXL255
package_id: MCXL255VDF
mcu_data: ksdk2_0
processor_version: 0.2603.90
pin_labels:
- {pin_num: F17, pin_signal: P0_3/AONTRIG_IN1/AON_LPI2C0_SDA/KPP_COL_1/LPTMR0_ALT1/QTMR0_OUT3/LCSenseCMP_CH2/AON_LPACMP_IN_2/AON_ACMP0_IN2, label: 'P0_3/J3[1]/J8[4]'}
- {pin_num: A17, pin_signal: P0_6/AONTRIG_OUT0/AON_LPI2C0_SCL/KPP_COL_0/AON_LPUART0_TX/AONTRIG_IN6/KPP_COL_2, label: 'P0_6/J8[9]/JP19[3]', identifier: AON_LPUART0_TX}
- {pin_num: F16, pin_signal: P0_2/AONTRIG_IN0/AON_LPI2C0_SCL/KPP_COL_0/LPTMR0_ALT2/QTMR0_OUT2/LCSenseCMP_CH1/AON_LPACMP_IN_1/AON_ACMP0_IN1, label: 'P0_2/J8[8]'}
- {pin_num: A16, pin_signal: P0_7/AONTRIG_OUT1/AON_LPI2C0_SDA/KPP_COL_1/AON_LPUART0_RX/AONTRIG_IN7/KPP_COL_3, label: 'P0_7/J8[7]/JP16[3]', identifier: AON_LPUART0_RX}
- {pin_num: F15, pin_signal: P0_4/AON_LPI2C0_SCL/KPP_ROW_2/LPTMR0_ALT0/LCSenseCMP_CH3/AON_LPACMP_IN_3/AON_ACMP0_IN3, label: 'P0_4/J8[21]', identifier: SW6}
- {pin_num: C14, pin_signal: P0_12/AONTRIG_IN4/AON_LPI2C0_SCL/KPP_ROW_0/LPTMR0_ALT2/QTMR1_OUT0/LPACMP_OUT/LCSensePushPullALT0_CH2/LCSenseTristateALT0_CH2/KPP_ROW_4/AON_ACMP0_IN4/AON_LPADC0_A0,
  label: 'P0_12/J2[9]/J3[5]/J8[5]', identifier: AON_LPI2C0_SCL}
- {pin_num: B14, pin_signal: P0_10/AONTRIG_IN2/AONCMP0_OUT/AON_LPACMP_IN_4/AON_LPADC0_A2, label: 'P0_10/J3[3]/J8[16]/U16[8]'}
- {pin_num: A12, pin_signal: P0_13/AONTRIG_IN5/AON_LPI2C0_SDA/KPP_ROW_1/LPTMR0_ALT3/QTMR1_OUT1/LPACMP_OUT/LCSensePushPullALT0_CH1/LCSenseTristateALT0_CH1/KPP_ROW_5/AON_LPADC0_A3,
  label: 'P0_13/J2[7]/J3[7]/J8[3]', identifier: AON_LPI2C0_SDA}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitDEBUG_UARTPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitDEBUG_UARTPins:
- options: {callFromInitBoot: 'true', coreID: cm0plus, enableClock: 'true', fullInit: 'true'}
- pin_list:
  - {pin_num: A17, peripheral: AON__LPUART0, signal: TX, pin_signal: P0_6/AONTRIG_OUT0/AON_LPI2C0_SCL/KPP_COL_0/AON_LPUART0_TX/AONTRIG_IN6/KPP_COL_2, identifier: '',
    slew_rate: fast, open_drain: disable, drive_strength: low, extra_drive_strength: normal, pull_select: down, pull_enable: disable, passive_filter: disable, pull_value: low,
    input_buffer: enable, invert_input: normal}
  - {pin_num: A16, peripheral: AON__LPUART0, signal: RX, pin_signal: P0_7/AONTRIG_OUT1/AON_LPI2C0_SDA/KPP_COL_1/AON_LPUART0_RX/AONTRIG_IN7/KPP_COL_3, identifier: '',
    slew_rate: fast, open_drain: disable, drive_strength: low, extra_drive_strength: normal, pull_select: down, pull_enable: disable, passive_filter: disable, pull_value: low,
    input_buffer: enable, invert_input: normal}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitDEBUG_UARTPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitDEBUG_UARTPins(void)
{
    /* AON.PORT0 Clock Enable: Enable */
    CLOCK_EnableClock(kCLOCK_GateAonPORT);
    /* AON__LPUART0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kAonUART_RST_SHIFT_RSTn);

    const port_pin_config_t port0_6_pinA17_config = {/* Internal pull-up/down resistor is disabled */
                                                     kPORT_PullDisable,
                                                     /* Low internal pull resistor value is selected. */
                                                     kPORT_LowPullResistor,
                                                     /* Fast slew rate is configured */
                                                     kPORT_FastSlewRate,
                                                     /* Passive input filter is disabled */
                                                     kPORT_PassiveFilterDisable,
                                                     /* Open drain output is disabled */
                                                     kPORT_OpenDrainDisable,
                                                     /* Low drive strength is configured */
                                                     kPORT_LowDriveStrength,
                                                     /* Normal drive strength is configured */
                                                     kPORT_NormalDriveStrength,
                                                     /* Pin is configured as AON_LPUART0_TX */
                                                     kPORT_MuxAlt4,
                                                     /* Digital input enabled */
                                                     kPORT_InputBufferEnable,
                                                     /* Digital input is not inverted */
                                                     kPORT_InputNormal,
                                                     /* Pin Control Register fields [15:0] are not locked */
                                                     kPORT_UnlockRegister};
    /* PORT0_6 (pin A17) is configured as AON_LPUART0_TX */
    PORT_SetPinConfig(AON__PORT0, 6U, &port0_6_pinA17_config);

    const port_pin_config_t port0_7_pinA16_config = {/* Internal pull-up/down resistor is disabled */
                                                     kPORT_PullDisable,
                                                     /* Low internal pull resistor value is selected. */
                                                     kPORT_LowPullResistor,
                                                     /* Fast slew rate is configured */
                                                     kPORT_FastSlewRate,
                                                     /* Passive input filter is disabled */
                                                     kPORT_PassiveFilterDisable,
                                                     /* Open drain output is disabled */
                                                     kPORT_OpenDrainDisable,
                                                     /* Low drive strength is configured */
                                                     kPORT_LowDriveStrength,
                                                     /* Normal drive strength is configured */
                                                     kPORT_NormalDriveStrength,
                                                     /* Pin is configured as AON_LPUART0_RX */
                                                     kPORT_MuxAlt4,
                                                     /* Digital input enabled */
                                                     kPORT_InputBufferEnable,
                                                     /* Digital input is not inverted */
                                                     kPORT_InputNormal,
                                                     /* Pin Control Register fields [15:0] are not locked */
                                                     kPORT_UnlockRegister};
    /* PORT0_7 (pin A16) is configured as AON_LPUART0_RX */
    PORT_SetPinConfig(AON__PORT0, 7U, &port0_7_pinA16_config);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitI2CPins:
- options: {callFromInitBoot: 'false', coreID: cm0plus, enableClock: 'true', fullInit: 'true'}
- pin_list:
  - {pin_num: A12, peripheral: AON__LPI2C0, signal: SDA, pin_signal: P0_13/AONTRIG_IN5/AON_LPI2C0_SDA/KPP_ROW_1/LPTMR0_ALT3/QTMR1_OUT1/LPACMP_OUT/LCSensePushPullALT0_CH1/LCSenseTristateALT0_CH1/KPP_ROW_5/AON_LPADC0_A3,
    identifier: '', slew_rate: fast, open_drain: disable, drive_strength: low, extra_drive_strength: normal, pull_select: up, pull_enable: enable, passive_filter: disable,
    pull_value: low, input_buffer: enable, invert_input: normal}
  - {pin_num: C14, peripheral: AON__LPI2C0, signal: SCL, pin_signal: P0_12/AONTRIG_IN4/AON_LPI2C0_SCL/KPP_ROW_0/LPTMR0_ALT2/QTMR1_OUT0/LPACMP_OUT/LCSensePushPullALT0_CH2/LCSenseTristateALT0_CH2/KPP_ROW_4/AON_ACMP0_IN4/AON_LPADC0_A0,
    identifier: '', slew_rate: fast, open_drain: disable, drive_strength: low, extra_drive_strength: normal, pull_select: up, pull_enable: enable, passive_filter: disable,
    pull_value: low, input_buffer: enable, invert_input: normal}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

