nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxl255/common/pin_mux/cm0plus/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitACMPPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitACMPPins(void)
{
    /* AON.PORT0 Clock Enable: Enable */
    CLOCK_EnableClock(kCLOCK_GateAonPORT);
    /* AON__ACMP0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kAonACMP0_RST_SHIFT_RSTn);

    const port_pin_config_t port0_4_pinF15_config = {/* Internal pull-up/down resistor is disabled */
                                                     kPORT_PullDisable,
                                                     /* Low internal pull resistor value is selected. */
                                                     kPORT_LowPullResistor,
                                                     /* Fast slew rate is configured */
                                                     kPORT_FastSlewRate,
                                                     /* Passive input filter is disabled */
                                                     kPORT_PassiveFilterDisable,
                                                     /* Open drain output is disabled */
                                                     kPORT_OpenDrainDisable,
                                                     /* Low drive strength is configured */
                                                     kPORT_LowDriveStrength,
                                                     /* Normal drive strength is configured */
                                                     kPORT_NormalDriveStrength,
                                                     /* Pin is configured as AON_ACMP0_IN3, AON_LPACMP_IN_3 */
                                                     kPORT_MuxAlt0,
                                                     /* Digital input disabled; it is required for analog functions */
                                                     kPORT_InputBufferDisable,
                                                     /* Digital input is not inverted */
                                                     kPORT_InputNormal,
                                                     /* Pin Control Register fields [15:0] are not locked */
                                                     kPORT_UnlockRegister};
    /* PORT0_4 (pin F15) is configured as AON_ACMP0_IN3, AON_LPACMP_IN_3 */
    PORT_SetPinConfig(AON__PORT0, 4U, &port0_4_pinF15_config);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLPCMPPins:
- options: {callFromInitBoot: 'false', coreID: cm0plus, enableClock: 'true', fullInit: 'true'}
- pin_list:
  - {pin_num: F15, peripheral: AON__ACMP0, signal: 'IN, 3N', pin_signal: P0_4/AON_LPI2C0_SCL/KPP_ROW_2/LPTMR0_ALT0/LCSenseCMP_CH3/AON_LPACMP_IN_3/AON_ACMP0_IN3, identifier: '',
    slew_rate: fast, open_drain: disable, drive_strength: low, extra_drive_strength: normal, pull_select: down, pull_enable: disable, passive_filter: disable, pull_value: low,
    input_buffer: disable, invert_input: normal}
  - {pin_num: F15, peripheral: AON__ACMP0, signal: 'IN, 3P', pin_signal: P0_4/AON_LPI2C0_SCL/KPP_ROW_2/LPTMR0_ALT0/LCSenseCMP_CH3/AON_LPACMP_IN_3/AON_ACMP0_IN3, identifier: '',
    slew_rate: fast, open_drain: disable, drive_strength: low, extra_drive_strength: normal, pull_select: down, pull_enable: disable, passive_filter: disable, pull_value: low,
    input_buffer: disable, invert_input: normal}
  - {pin_num: F15, peripheral: AON__LPACMP, signal: 'IN, 5P', pin_signal: P0_4/AON_LPI2C0_SCL/KPP_ROW_2/LPTMR0_ALT0/LCSenseCMP_CH3/AON_LPACMP_IN_3/AON_ACMP0_IN3,
    identifier: '', slew_rate: fast, open_drain: disable, drive_strength: low, extra_drive_strength: normal, pull_select: down, pull_enable: disable, passive_filter: disable,
    pull_value: low, input_buffer: disable, invert_input: normal}
  - {pin_num: F15, peripheral: AON__LPACMP, signal: 'IN, 3N', pin_signal: P0_4/AON_LPI2C0_SCL/KPP_ROW_2/LPTMR0_ALT0/LCSenseCMP_CH3/AON_LPACMP_IN_3/AON_ACMP0_IN3,
    identifier: '', slew_rate: fast, open_drain: disable, drive_strength: low, extra_drive_strength: normal, pull_select: down, pull_enable: disable, passive_filter: disable,
    pull_value: low, input_buffer: disable, invert_input: normal}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLPCMPPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitLPCMPPins(void)
{
    /* AON.PORT0 Clock Enable: Enable */
    CLOCK_EnableClock(kCLOCK_GateAonPORT);
    /* AON__ACMP0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kAonACMP0_RST_SHIFT_RSTn);

    const port_pin_config_t port0_4_pinF15_config = {/* Internal pull-up/down resistor is disabled */
                                                     kPORT_PullDisable,
                                                     /* Low internal pull resistor value is selected. */
                                                     kPORT_LowPullResistor,
                                                     /* Fast slew rate is configured */
                                                     kPORT_FastSlewRate,
                                                     /* Passive input filter is disabled */
                                                     kPORT_PassiveFilterDisable,
                                                     /* Open drain output is disabled */
                                                     kPORT_OpenDrainDisable,
                                                     /* Low drive strength is configured */
                                                     kPORT_LowDriveStrength,
                                                     /* Normal drive strength is configured */
                                                     kPORT_NormalDriveStrength,
                                                     /* Pin is configured as AON_ACMP0_IN3, AON_LPACMP_IN_3 */
                                                     kPORT_MuxAlt0,
                                                     /* Digital input disabled; it is required for analog functions */
                                                     kPORT_InputBufferDisable,
                                                     /* Digital input is not inverted */
                                                     kPORT_InputNormal,
                                                     /* Pin Control Register fields [15:0] are not locked */
                                                     kPORT_UnlockRegister};
    /* PORT0_4 (pin F15) is configured as AON_ACMP0_IN3, AON_LPACMP_IN_3 */
    PORT_SetPinConfig(AON__PORT0, 4U, &port0_4_pinF15_config);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLPADCPins:
- options: {callFromInitBoot: 'false', coreID: cm0plus, enableClock: 'true', fullInit: 'true'}
- pin_list:
  - {pin_num: A12, peripheral: AON__LPADC0, signal: 'A, 3', pin_signal: P0_13/AONTRIG_IN5/AON_LPI2C0_SDA/KPP_ROW_1/LPTMR0_ALT3/QTMR1_OUT1/LPACMP_OUT/LCSensePushPullALT0_CH1/LCSenseTristateALT0_CH1/KPP_ROW_5/AON_LPADC0_A3,
    identifier: '', slew_rate: fast, open_drain: disable, drive_strength: low, extra_drive_strength: normal, pull_select: down, pull_enable: disable, passive_filter: disable,
    pull_value: low, input_buffer: disable, invert_input: normal}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

