nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxl255/common/pin_mux/cm0plus/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLPADCPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitLPADCPins(void)
{
    /* AON.PORT0 Clock Enable: Enable */
    CLOCK_EnableClock(kCLOCK_GateAonPORT);
    /* AON__LPADC0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kAonLPADC_RST_SHIFT_RSTn);

    const port_pin_config_t port0_13_pinA12_config = {/* Internal pull-up/down resistor is disabled */
                                                      kPORT_PullDisable,
                                                      /* Low internal pull resistor value is selected. */
                                                      kPORT_LowPullResistor,
                                                      /* Fast slew rate is configured */
                                                      kPORT_FastSlewRate,
                                                      /* Passive input filter is disabled */
                                                      kPORT_PassiveFilterDisable,
                                                      /* Open drain output is disabled */
                                                      kPORT_OpenDrainDisable,
                                                      /* Low drive strength is configured */
                                                      kPORT_LowDriveStrength,
                                                      /* Normal drive strength is configured */
                                                      kPORT_NormalDriveStrength,
                                                      /* Pin is configured as AON_LPADC0_A3 */
                                                      kPORT_MuxAlt0,
                                                      /* Digital input disabled; it is required for analog functions */
                                                      kPORT_InputBufferDisable,
                                                      /* Digital input is not inverted */
                                                      kPORT_InputNormal,
                                                      /* Pin Control Register fields [15:0] are not locked */
                                                      kPORT_UnlockRegister};
    /* PORT0_13 (pin A12) is configured as AON_LPADC0_A3 */
    PORT_SetPinConfig(AON__PORT0, 13U, &port0_13_pinA12_config);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitKPPPins:
- options: {callFromInitBoot: 'false', coreID: cm0plus, enableClock: 'true', fullInit: 'true'}
- pin_list:
  - {pin_num: F16, peripheral: AON__KPP0, signal: 'kpp_col, 0', pin_signal: P0_2/AONTRIG_IN0/AON_LPI2C0_SCL/KPP_COL_0/LPTMR0_ALT2/QTMR0_OUT2/LCSenseCMP_CH1/AON_LPACMP_IN_1/AON_ACMP0_IN1,
    slew_rate: fast, open_drain: enable, drive_strength: low, extra_drive_strength: normal, pull_select: down, pull_enable: disable, passive_filter: disable, pull_value: low,
    input_buffer: enable, invert_input: normal}
  - {pin_num: F17, peripheral: AON__KPP0, signal: 'kpp_col, 1', pin_signal: P0_3/AONTRIG_IN1/AON_LPI2C0_SDA/KPP_COL_1/LPTMR0_ALT1/QTMR0_OUT3/LCSenseCMP_CH2/AON_LPACMP_IN_2/AON_ACMP0_IN2,
    slew_rate: fast, open_drain: enable, drive_strength: low, extra_drive_strength: normal, pull_select: down, pull_enable: disable, passive_filter: disable, pull_value: low,
    input_buffer: enable, invert_input: normal}
  - {pin_num: C14, peripheral: AON__KPP0, signal: 'kpp_row, 0', pin_signal: P0_12/AONTRIG_IN4/AON_LPI2C0_SCL/KPP_ROW_0/LPTMR0_ALT2/QTMR1_OUT0/LPACMP_OUT/LCSensePushPullALT0_CH2/LCSenseTristateALT0_CH2/KPP_ROW_4/AON_ACMP0_IN4/AON_LPADC0_A0,
    identifier: '', slew_rate: fast, open_drain: disable, drive_strength: low, extra_drive_strength: normal, pull_select: up, pull_enable: enable, passive_filter: disable,
    pull_value: low, input_buffer: enable, invert_input: normal}
  - {pin_num: A12, peripheral: AON__KPP0, signal: 'kpp_row, 1', pin_signal: P0_13/AONTRIG_IN5/AON_LPI2C0_SDA/KPP_ROW_1/LPTMR0_ALT3/QTMR1_OUT1/LPACMP_OUT/LCSensePushPullALT0_CH1/LCSenseTristateALT0_CH1/KPP_ROW_5/AON_LPADC0_A3,
    identifier: '', slew_rate: fast, open_drain: disable, drive_strength: low, extra_drive_strength: normal, pull_select: up, pull_enable: enable, passive_filter: disable,
    pull_value: low, input_buffer: enable, invert_input: normal}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitKPPPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitKPPPins(void)
{
    /* AON.PORT0 Clock Enable: Enable */
    CLOCK_EnableClock(kCLOCK_GateAonPORT);
    /* AON__KPP0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kAonKPP_RST_SHIFT_RSTn);

    const port_pin_config_t port0_12_pinC14_config = {/* Internal pull-up resistor is enabled */
                                                      kPORT_PullUp,
                                                      /* Low internal pull resistor value is selected. */
                                                      kPORT_LowPullResistor,
                                                      /* Fast slew rate is configured */
                                                      kPORT_FastSlewRate,
                                                      /* Passive input filter is disabled */
                                                      kPORT_PassiveFilterDisable,
                                                      /* Open drain output is disabled */
                                                      kPORT_OpenDrainDisable,
                                                      /* Low drive strength is configured */
                                                      kPORT_LowDriveStrength,
                                                      /* Normal drive strength is configured */
                                                      kPORT_NormalDriveStrength,
                                                      /* Pin is configured as KPP_ROW_0 */
                                                      kPORT_MuxAlt3,
                                                      /* Digital input enabled */
                                                      kPORT_InputBufferEnable,
                                                      /* Digital input is not inverted */
                                                      kPORT_InputNormal,
                                                      /* Pin Control Register fields [15:0] are not locked */
                                                      kPORT_UnlockRegister};
    /* PORT0_12 (pin C14) is configured as KPP_ROW_0 */
    PORT_SetPinConfig(AON__PORT0, 12U, &port0_12_pinC14_config);

