nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxl255/common/pin_mux/cm0plus/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLPACMPPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitLPACMPPins(void)
{
    /* AON.PORT0 Clock Enable: Enable */
    CLOCK_EnableClock(kCLOCK_GateAonPORT);
    /* AON__LPADC0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kAonLPADC_RST_SHIFT_RSTn);

    const port_pin_config_t port0_10_pinB14_config = {/* Internal pull-up/down resistor is disabled */
                                                      kPORT_PullDisable,
                                                      /* Low internal pull resistor value is selected. */
                                                      kPORT_LowPullResistor,
                                                      /* Fast slew rate is configured */
                                                      kPORT_FastSlewRate,
                                                      /* Passive input filter is disabled */
                                                      kPORT_PassiveFilterDisable,
                                                      /* Open drain output is disabled */
                                                      kPORT_OpenDrainDisable,
                                                      /* Low drive strength is configured */
                                                      kPORT_LowDriveStrength,
                                                      /* Normal drive strength is configured */
                                                      kPORT_NormalDriveStrength,
                                                      /* Pin is configured as AON_LPACMP_IN_4, AON_LPADC0_A2 */
                                                      kPORT_MuxAlt0,
                                                      /* Digital input disabled; it is required for analog functions */
                                                      kPORT_InputBufferDisable,
                                                      /* Digital input is not inverted */
                                                      kPORT_InputNormal,
                                                      /* Pin Control Register fields [15:0] are not locked */
                                                      kPORT_UnlockRegister};
    /* PORT0_10 (pin B14) is configured as AON_LPACMP_IN_4, AON_LPADC0_A2 */
    PORT_SetPinConfig(AON__PORT0, 10U, &port0_10_pinB14_config);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
